InformationRegisters/ЖурналФискальныхОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ЖурналФискальныхОпераций</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияБПО</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТорговыйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТорговыйОбъектБПО</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Устройство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОперацииКассовогоУзла</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФискальнаяОперацияТипРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРасчетаДенежнымиСредствами</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФискальнаяОперацияВариантОтправкиЭлектронногоЧека</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОтправкиЭлектронногоЧекаПокупателю</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФискальнаяОперацияКонтактныеДанныеЭлектронногоЧека</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФискальнаяОперацияНомерЧекаККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФискальнаяОперацияНомерСменыККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФискальнаяОперацияСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФискальнаяОперацияСуммаОплатыНаличные</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФискальнаяОперацияСуммаОплатыПлатежнаяКарта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФискальнаяОперацияСуммаПредоплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФискальнаяОперацияСуммаКредит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеФискальнойОперации</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыОперацииКассовогоУзла.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипыОперацииКассовогоУзла</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФискальнаяОперация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнесениеДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыемкаДенежныхСредств</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ПодключаемоеОборудованиеУТСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Записать операцию в журнал фискальных операций.
//
// Параметры:
//  РеквизитыОперацииКассовогоУзла - Структура - см. функцию ПодключаемоеОборудованиеУТКлиент.СтруктураРеквизитыФискальнойОперацииКассовогоУзла().
//
Процедура ЗаписатьВЖурналФискальныхОперацийУпрощенно(РеквизитыОперацииКассовогоУзла) Экспорт
	
	ИдентификаторЗаписи = Новый УникальныйИдентификатор;
	
	НаборЗаписей = РегистрыСведений.ЖурналФискальныхОпераций.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторЗаписи.Установить(ИдентификаторЗаписи, Истина);
	НаборЗаписей.Отбор.ДокументОснование.Установить(РеквизитыОперацииКассовогоУзла.ДокументОснование, Истина);
	
	НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.ИдентификаторЗаписи = ИдентификаторЗаписи;
	
	НоваяСтрока.Дата = РеквизитыОперацииКассовогоУзла.Дата;
	НоваяСтрока.ДокументОснование = РеквизитыОперацииКассовогоУзла.ДокументОснование;
	НоваяСтрока.Организация = РеквизитыОперацииКассовогоУзла.Организация;
	НоваяСтрока.ТорговыйОбъект = РеквизитыОперацииКассовогоУзла.ТорговыйОбъект;
	НоваяСтрока.Устройство = РеквизитыОперацииКассовогоУзла.Устройство;
	
	НоваяСтрока.ТипОперации = РеквизитыОперацииКассовогоУзла.ТипОперации;
	
	Если РеквизитыОперацииКассовогоУзла.ТипОперации = Перечисления.ТипыОперацииКассовогоУзла.ФискальнаяОперация Тогда
		
		НоваяСтрока.ФискальнаяОперацияТипРасчета = РеквизитыОперацииКассовогоУзла.ТипРасчета;
		
		НоваяСтрока.ФискальнаяОперацияВариантОтправкиЭлектронногоЧека = РеквизитыОперацииКассовогоУзла.ВариантОтправкиЭлектронногоЧека;
		НоваяСтрока.ФискальнаяОперацияКонтактныеДанныеЭлектронногоЧека = РеквизитыОперацииКассовогоУзла.КонтактныеДанныеЭлектронногоЧека;
		НоваяСтрока.ФискальнаяОперацияНомерЧекаККМ = РеквизитыОперацииКассовогоУзла.НомерЧекаККМ;
		НоваяСтрока.ФискальнаяОперацияНомерСменыККМ = РеквизитыОперацииКассовогоУзла.НомерСмены;
		
		НоваяСтрока.ФискальнаяОперацияСумма = РеквизитыОперацииКассовогоУзла.Сумма;
		НоваяСтрока.ФискальнаяОперацияСуммаОплатыНаличные = РеквизитыОперацииКассовогоУзла.СуммаОплатыНаличные;
		НоваяСтрока.ФискальнаяОперацияСуммаОплатыПлатежнаяКарта = РеквизитыОперацииКассовогоУзла.СуммаОплатыПлатежнаяКарта;
		НоваяСтрока.ФискальнаяОперацияСуммаКредит = РеквизитыОперацииКассовогоУзла.СуммаКредит;
		НоваяСтрока.ФискальнаяОперацияСуммаПредоплаты = РеквизитыОперацииКассовогоУзла.СуммаПредоплаты;
		
		Если РеквизитыОперацииКассовогоУзла.Данные <> Неопределено Тогда
			НоваяСтрока.Данные = Новый ХранилищеЗначения(РеквизитыОперацииКассовогоУзла.Данные);
		КонецЕсли;
		
	Иначе
		
		НоваяСтрока.ФискальнаяОперацияСумма = РеквизитыОперацииКассовогоУзла.Сумма;
		
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Сравнивает переданную версию ФФД на актуальность (На текущий момент актуальная версия 1.0.5)
//
// Параметры:
//  ВерсияФФД - Строка - Версия ФФД.
// 
// Возвращаемое значение:
//  Булево - Версия актуальна.
//
Функция ПоддерживаетсяФорматФФД1_0_5(ВерсияФФД) Экспорт
	
	Возврат ВерсияФФД = "1.0.5";
	
КонецФункции

#КонецОбласти
